Revit 2027 API
ParameterTypeId.DividedSurfaceTotalEdgeLength Property
 "Total edge length"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId DividedSurfaceTotalEdgeLength { get; }
Public Shared ReadOnly Property DividedSurfaceTotalEdgeLength As ForgeTypeId
	Get
public:
static property ForgeTypeId^ DividedSurfaceTotalEdgeLength {
	ForgeTypeId^ get ();
}
static member DividedSurfaceTotalEdgeLength : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace